mfkiwl/McuDevelop/Devices/STM32/include/stm32Otg.h
/*
 * Copyright (c) 2016 zhtlab
 *
 * Permission is hereby granted, free of charge, to any person obtaining
 * a copy of this software and associated documentation files
 * (the "Software"), to deal in the Software without restriction, including
 * without limitation the rights to use, copy, modify, merge, publish,
 * distribute, sublicense, and/or sell copies of the Software, and to permit
 * persons to whom the Software is furnished to do so, subject to
 * the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 */

#ifndef _STM32OTG_H_
#define _STM32OTG_H_

typedef struct {
  __IO uint32_t         CTL;
#define USB_EPCTL_EPENA_SHIFT   (31)
#define USB_EPCTL_EPENA_MASK    (1 << (USB_EPCTL_EPENA_SHIFT))
#define USB_EPCTL_EPENA_NO      (0 << (USB_EPCTL_EPENA_SHIFT))
#define USB_EPCTL_EPENA_YES     (1 << (USB_EPCTL_EPENA_SHIFT))
#define USB_EPCTL_EPDIS_SHIFT   (30)
#define USB_EPCTL_EPDIS_MASK    (1 << (USB_EPCTL_EPDIS_SHIFT))
#define USB_EPCTL_EPDIS_NO      (0 << (USB_EPCTL_EPDIS_SHIFT))
#define USB_EPCTL_EPDIS_YES     (1 << (USB_EPCTL_EPDIS_SHIFT))
#define USB_EPCTL_SD1PID_SODDFRM_SHIFT  (29)
#define USB_EPCTL_SD1PID_SODDFRM_MASK   (1 << (USB_EPCTL_SD1PID_SODDFRM_SHIFT))
#define USB_EPCTL_SD1PID_SODDFRM        (1 << (USB_EPCTL_SD1PID_SODDFRM_SHIFT))
#define USB_EPCTL_SD0PID_SEVNFRM_SHIFT  (28)
#define USB_EPCTL_SD0PID_SEVNFRM_MASK   (1 << (USB_EPCTL_SD0PID_SEVNFRM_SHIFT))
#define USB_EPCTL_SD0PID_SEVNFRM        (1 << (USB_EPCTL_SD0PID_SEVNFRM_SHIFT))
#define USB_EPCTL_SNAK_SHIFT    (27)
#define USB_EPCTL_SNAK_MASK     (1 << (USB_EPCTL_SNAK_SHIFT))
#define USB_EPCTL_SNAK          (1 << (USB_EPCTL_SNAK_SHIFT))
#define USB_EPCTL_CNAK_SHIFT    (26)
#define USB_EPCTL_CNAK_MASK     (1 << (USB_EPCTL_CNAK_SHIFT))
#define USB_EPCTL_CNAK          (1 << (USB_EPCTL_CNAK_SHIFT))
#define USB_EPCTL_TXFNUM_SHIFT  (22)
#define USB_EPCTL_TXFNUM_MASK   (0xf  << (USB_EPCTL_TXFNUM_SHIFT))
#define USB_EPCTL_TXFNUM_VAL(x) (((x) << (USB_EPCTL_TXFNUM_SHIFT)) & USB_EPCTL_TXFNUM_MASK)
#define USB_EPCTL_STALL_SHIFT   (21)
#define USB_EPCTL_STALL_MASK    (1 << (USB_EPCTL_STALL_SHIFT))
#define USB_EPCTL_STALL_NO      (0 << (USB_EPCTL_STALL_SHIFT))
#define USB_EPCTL_STALL_YES     (1 << (USB_EPCTL_STALL_SHIFT))
#define USB_EPCTL_EPTYP_SHIFT   (18)
#define USB_EPCTL_EPTYP_MASK    (3 << (USB_EPCTL_EPTYP_SHIFT))
#define USB_EPCTL_EPTYP_CTRL    (0 << (USB_EPCTL_EPTYP_SHIFT))
#define USB_EPCTL_EPTYP_ISOC    (1 << (USB_EPCTL_EPTYP_SHIFT))
#define USB_EPCTL_EPTYP_BULK    (2 << (USB_EPCTL_EPTYP_SHIFT))
#define USB_EPCTL_EPTYP_INTR    (3 << (USB_EPCTL_EPTYP_SHIFT))
#define USB_EPCTL_USBAEP_SHIFT  (15)
#define USB_EPCTL_USBAEP_MASK   (1 << (USB_EPCTL_USBAEP_SHIFT))
#define USB_EPCTL_USBAEP_NO     (0 << (USB_EPCTL_USBAEP_SHIFT))
#define USB_EPCTL_USBAEP_YES    (1 << (USB_EPCTL_USBAEP_SHIFT))
#define USB_EPCTL_MPSIZ_SHIFT   (0)
#define USB_EPCTL_MPSIZ_MASK    (0x3ff << (USB_EPCTL_MPSIZ_SHIFT))
#define USB_EPCTL_MPSIZ_VAL(x)  ((x) << (USB_EPCTL_MPSIZ_SHIFT))

  uint32_t              reserved04;
  __IO uint32_t         INT;            /* 0x08 */
#define USB_EPINT_NAK_SHIFT     (13)
#define USB_EPINT_NAK_MASK      (1 << (USB_EPINT_NAK_SHIFT))
#define USB_EPINT_TXFE_SHIFT    (7)
#define USB_EPINT_TXFE_MASK     (1 << (USB_EPINT_TXFE_SHIFT))
#define USB_EPINT_B2BSTUP_SHIFT (6)
#define USB_EPINT_B2BSTUP_MASK  (1 << (USB_EPINT_B2BSTUP_SHIFT))
#define USB_EPINT_STSPHSRX_SHIFT (5)
#define USB_EPINT_STSPHSRX_MASK  (1 << (USB_EPINT_STSPHSRX_SHIFT))
#define USB_EPINT_OTEPDIS_SHIFT (4)
#define USB_EPINT_OTEPDIS_MASK  (1 << (USB_EPINT_OTEPDIS_SHIFT))
#define USB_EPINT_STUP_SHIFT    (3)
#define USB_EPINT_STUP_MASK     (1 << (USB_EPINT_STUP_SHIFT))
#define USB_EPINT_EPDISD_SHIFT  (1)
#define USB_EPINT_EPDISD_MASK   (1 << (USB_EPINT_EPDISD_SHIFT))
#define USB_EPINT_XFRC_SHIFT    (0)
#define USB_EPINT_XFRC_MASK     (1 << (USB_EPINT_XFRC_SHIFT))

  uint32_t              reserved0c;
  __IO uint32_t         SIZ;            /* 0x10 */
  /* STUPCNT is for SETUP OUT packet */
#define USB_EPSIZ_STUPCNT_SHIFT (29)
#define USB_EPSIZ_STUPCNT_MASK  (3 << (USB_EPSIZ_STUPCNT_SHIFT))
#define USB_EPSIZ_STUPCNT_1PKTS (1 << (USB_EPSIZ_STUPCNT_SHIFT))
#define USB_EPSIZ_STUPCNT_2PKTS (2 << (USB_EPSIZ_STUPCNT_SHIFT))
#define USB_EPSIZ_STUPCNT_3PKTS (3 << (USB_EPSIZ_STUPCNT_SHIFT))
  /* MCNT is for IN packet and EP1,2, ... */
#define USB_EPSIZ_MCNT_SHIFT    (29)
#define USB_EPSIZ_MCNT_MASK     (3 << (USB_EPSIZ_MCNT_SHIFT))
#define USB_EPSIZ_MCNT_1PKTS    (1 << (USB_EPSIZ_MCNT_SHIFT))
#define USB_EPSIZ_MCNT_2PKTS    (2 << (USB_EPSIZ_MCNT_SHIFT))
#define USB_EPSIZ_MCNT_3PKTS    (3 << (USB_EPSIZ_MCNT_SHIFT))
#define USB_EPSIZ_PKTCNT_SHIFT  (19)
#define USB_EPSIZ_PKTCNT_MASK   (1 << (USB_EPSIZ_PKTCNT_SHIFT))
#define USB_EPSIZ_PKTCNT_ZERO   (0 << (USB_EPSIZ_PKTCNT_SHIFT))
#define USB_EPSIZ_PKTCNT_ONE    (1 << (USB_EPSIZ_PKTCNT_SHIFT))
#define USB_EPSIZ_PKTCNT_TWO    (2 << (USB_EPSIZ_PKTCNT_SHIFT))
#define USB_EPSIZ_PKTCNT_THREE  (3 << (USB_EPSIZ_PKTCNT_SHIFT))
#define USB_EPSIZ_XFRSIZ_SHIFT  (0)
#define USB_EPSIZ_XFRSIZ_MASK   (0x7f << (USB_EPSIZ_XFRSIZ_SHIFT))
#define USB_EPSIZ_XFRSIZ_VAL(x) (((x) << (USB_EPSIZ_XFRSIZ_SHIFT)) & (USB_EPSIZ_XFRSIZ_MASK))
  __IO uint32_t         DMA;            /* 0x14  out only */
  __IO uint32_t         STS;            /* 0x18  in only */
  uint32_t              reserved1c;
} stm32Usb320aDevEp_t;

typedef struct {
  /* 0x00 */
  __IO uint32_t         GOTGCTL;
#define USB_GOTGCTL_BVALOVAL_SHIFT      (7)
#define USB_GOTGCTL_BVALOVAL_MASK       (1 << (USB_GOTGCTL_BVALOVAL_SHIFT))
#define USB_GOTGCTL_BVALOVAL_NOS        (0 << (USB_GOTGCTL_BVALOVAL_SHIFT))
#define USB_GOTGCTL_BVALOVAL_YES        (1 << (USB_GOTGCTL_BVALOVAL_SHIFT))
#define USB_GOTGCTL_BVALOEN_SHIFT       (6)
#define USB_GOTGCTL_BVALOEN_MASK        (1 << (USB_GOTGCTL_BVALOEN_SHIFT))
#define USB_GOTGCTL_BVALOEN_NO          (0 << (USB_GOTGCTL_BVALOEN_SHIFT))
#define USB_GOTGCTL_BVALOEN_YES         (1 << (USB_GOTGCTL_BVALOEN_SHIFT))

