mfkiwl/McuDevelop/Devices/STM32/include/stm32Otg.h
  __IO uint32_t         GOTGINT;
#define USB_GOTGINT_SEDET_SHIFT         (2)
#define USB_GOTGINT_SEDET_MASK          (1 << (USB_GOTGINT_SEDET_SHIFT))
#define USB_GOTGINT_SEDET_DIS           (0 << (USB_GOTGINT_SEDET_SHIFT))
#define USB_GOTGINT_SEDET_EN            (1 << (USB_GOTGINT_SEDET_SHIFT))


/*** 0x08 OTG_GAHBCFG     x is available to set 1 to 16 */
  __IO uint32_t         GAHBCFG;
#define USB_GAHBCFG_DMAEN_SHIFT         (4)
#define USB_GAHBCFG_DMAEN_MASK          (1 << (USB_GAHBCFG_DMAEN_SHIFT))
#define USB_GAHBCFG_DMAEN_NO            (0 << (USB_GAHBCFG_DMAEN_SHIFT))
#define USB_GAHBCFG_DMAEN_YES           (1 << (USB_GAHBCFG_DMAEN_SHIFT))
#define USB_GAHBCFG_HBSTLEN_SHIFT       (1)
#define USB_GAHBCFG_HBSTLEN_MASK        (15 << (USB_GAHBCFG_HBSTLEN_SHIFT))
#define USB_GAHBCFG_HBSTLEN_1WORD       (0 << (USB_GAHBCFG_HBSTLEN_SHIFT))
#define USB_GAHBCFG_HBSTLEN_4WORDS      (3 << (USB_GAHBCFG_HBSTLEN_SHIFT))
#define USB_GAHBCFG_HBSTLEN_8WORDS      (3 << (USB_GAHBCFG_HBSTLEN_SHIFT))
#define USB_GAHBCFG_HBSTLEN_16WORDS     (7 << (USB_GAHBCFG_HBSTLEN_SHIFT))
#define USB_GAHBCFG_GINTMSK_SHIFT       (0)
#define USB_GAHBCFG_GINTMSK_MASK        (1 << (USB_GAHBCFG_GINTMSK_SHIFT))
#define USB_GAHBCFG_GINTMSK_NO          (0 << (USB_GAHBCFG_GINTMSK_SHIFT))
#define USB_GAHBCFG_GINTMSK_YES         (1 << (USB_GAHBCFG_GINTMSK_SHIFT))

  __IO uint32_t         GUSBCFG;
  __IO uint32_t         GRSTCTL;
#define USB_GRSTCTL_TXFNUM_SHIFT        (6)
#define USB_GRSTCTL_TXFNUM_MASK         (0x1f << (USB_GRSTCTL_TXFNUM_SHIFT))
#define USB_GRSTCTL_TXFNUM(x)           (((x) << (USB_GRSTCTL_TXFNUM_SHIFT)) & (USB_GRSTCTL_TXFNUM_MASK))
#define USB_GRSTCTL_TXFNUM_ALL          (0x10 << (USB_GRSTCTL_TXFNUM_SHIFT))
#define USB_GRSTCTL_TXFFLSH_SHIFT       (5)
#define USB_GRSTCTL_TXFFLSH_MASK        (1 << (USB_GRSTCTL_TXFFLSH_SHIFT))
#define USB_GRSTCTL_TXFFLSH_DIS         (0 << (USB_GRSTCTL_TXFFLSH_SHIFT))
#define USB_GRSTCTL_TXFFLSH_EN          (1 << (USB_GRSTCTL_TXFFLSH_SHIFT))
#define USB_GRSTCTL_RXFFLSH_SHIFT       (4)
#define USB_GRSTCTL_RXFFLSH_MASK        (1 << (USB_GRSTCTL_RXFFLSH_SHIFT))
#define USB_GRSTCTL_RXFFLSH_DIS         (0 << (USB_GRSTCTL_RXFFLSH_SHIFT))
#define USB_GRSTCTL_RXFFLSH_EN          (1 << (USB_GRSTCTL_RXFFLSH_SHIFT))
#define USB_GRSTCTL_CSRST_SHIFT         (0)
#define USB_GRSTCTL_CSRST_MASK          (1 << (USB_GRSTCTL_CSRST_SHIFT))
#define USB_GRSTCTL_CSRST_DIS           (0 << (USB_GRSTCTL_CSRST_SHIFT))
#define USB_GRSTCTL_CSRST_EN            (1 << (USB_GRSTCTL_CSRST_SHIFT))

  __IO uint32_t         GINTSTS;
  __IO uint32_t         GINTMSK;
#define USB_GINTSTS_WKUINT_SHIFT        (31)
#define USB_GINTSTS_WKUINT_MASK         (1 << (USB_GINTSTS_WKUINT_SHIFT))
#define USB_GINTSTS_WKUINT_EN           (1 << (USB_GINTSTS_WKUINT_SHIFT))
#define USB_GINTSTS_SRQINT_SHIFT        (30)
#define USB_GINTSTS_SRQINT_MASK         (1 << (USB_GINTSTS_SRQINT_SHIFT))
#define USB_GINTSTS_SRQINT_EN           (1 << (USB_GINTSTS_SRQINT_SHIFT))
#define USB_GINTSTS_DISCINT_SHIFT       (29)
#define USB_GINTSTS_DISCINT_MASK        (1 << (USB_GINTSTS_DISCINT_SHIFT))
#define USB_GINTSTS_DISCINT_EN          (1 << (USB_GINTSTS_DISCINT_SHIFT))
#define USB_GINTSTS_CIDSCHG_SHIFT       (28)
#define USB_GINTSTS_CIDSCHG_MASK        (1 << (USB_GINTSTS_CIDSCHG_SHIFT))
#define USB_GINTSTS_CIDSCHG_EN          (1 << (USB_GINTSTS_CIDSCHG_SHIFT))
#define USB_GINTSTS_LPMINT_SHIFT        (27)
#define USB_GINTSTS_LPMINT_MASK         (1 << (USB_GINTSTS_LPMINT_SHIFT))
#define USB_GINTSTS_LPMINT_EN           (1 << (USB_GINTSTS_LPMINT_SHIFT))
#define USB_GINTSTS_PXFRM_IISOOXFR_SHIFT      (21)
#define USB_GINTSTS_PXFRM_IISOOXFR_MASK       (1 << (USB_GINTSTS_PXFRM_IISOOXFR_SHIFT))
#define USB_GINTSTS_PXFRM_IISOOXFR_EN         (1 << (USB_GINTSTS_PXFRM_IISOOXFR_SHIFT))
#define USB_GINTSTS_IISOIXFR_SHIFT      (20)
#define USB_GINTSTS_IISOIXFR_MASK       (1 << (USB_GINTSTS_IISOIXFR_SHIFT))
#define USB_GINTSTS_IISOIXFR_EN         (1 << (USB_GINTSTS_IISOIXFR_SHIFT))
#define USB_GINTSTS_OEPINT_SHIFT        (19)
#define USB_GINTSTS_OEPINT_MASK         (1 << (USB_GINTSTS_OEPINT_SHIFT))
#define USB_GINTSTS_OEPINT_EN           (1 << (USB_GINTSTS_OEPINT_SHIFT))
#define USB_GINTSTS_IEPINT_SHIFT        (18)
#define USB_GINTSTS_IEPINT_MASK         (1 << (USB_GINTSTS_IEPINT_SHIFT))
#define USB_GINTSTS_IEPINT_EN           (1 << (USB_GINTSTS_IEPINT_SHIFT))

#define USB_GINTSTS_ENUMDNE_SHIFT       (13)
#define USB_GINTSTS_ENUMDNE_MASK        (1 << (USB_GINTSTS_ENUMDNE_SHIFT))
#define USB_GINTSTS_ENUMDNE_EN          (1 << (USB_GINTSTS_ENUMDNE_SHIFT))
#define USB_GINTSTS_USBRST_SHIFT        (12)
#define USB_GINTSTS_USBRST_MASK         (1 << (USB_GINTSTS_USBRST_SHIFT))
#define USB_GINTSTS_USBRST_EN           (1 << (USB_GINTSTS_USBRST_SHIFT))
#define USB_GINTSTS_USBSUSP_SHIFT       (11)
#define USB_GINTSTS_USBSUSP_MASK        (1 << (USB_GINTSTS_USBSUSP_SHIFT))
#define USB_GINTSTS_USBSUSP_EN          (1 << (USB_GINTSTS_USBSUSP_SHIFT))
#define USB_GINTSTS_ESUSP_SHIFT         (10)
#define USB_GINTSTS_ESUSP_MASK          (1 << (USB_GINTSTS_ESUSP_SHIFT))
#define USB_GINTSTS_ESUSP_EN            (1 << (USB_GINTSTS_ESUSP_SHIFT))
#define USB_GINTSTS_RXFLVL_SHIFT        (4)
#define USB_GINTSTS_RXFLVL_MASK         (1 << (USB_GINTSTS_RXFLVL_SHIFT))
#define USB_GINTSTS_RXFLVL_EN           (1 << (USB_GINTSTS_RXFLVL_SHIFT))
#define USB_GINTSTS_SOF_SHIFT           (3)
#define USB_GINTSTS_SOF_MASK            (1 << (USB_GINTSTS_SOF_SHIFT))
#define USB_GINTSTS_SOF_EN              (1 << (USB_GINTSTS_SOF_SHIFT))
#define USB_GINTSTS_OTGINT_SHIFT        (2)
#define USB_GINTSTS_OTGINT_MASK         (1 << (USB_GINTSTS_OTGINT_SHIFT))
#define USB_GINTSTS_OTGINT_EN           (1 << (USB_GINTSTS_OTGINT_SHIFT))
#define USB_GINTSTS_MMIS_SHIFT          (1)
#define USB_GINTSTS_MMIS_MASK           (1 << (USB_GINTSTS_MMIS_SHIFT))
#define USB_GINTSTS_MMIS_EN             (1 << (USB_GINTSTS_MMIS_SHIFT))
#define USB_GINTSTS_CMOD_SHIFT          (0)
#define USB_GINTSTS_CMOD_MASK           (1 << (USB_GINTSTS_CMOD_SHIFT))

