mfkiwl/McuDevelop/Devices/STM32/include/stm32Otg.h
  __IO uint32_t         GRXSTSR;                /* debug */
  __IO uint32_t         GRXSTSP;                /* normal use */
#define USB_GRXSTSP_FRMNUM_SHIFT         (21)
#define USB_GRXSTSP_FRMNUM_MASK          (0xf << (USB_GRXSTSP_FRMNUM_SHIFT))
#define USB_GRXSTSP_PKTSTS_SHIFT         (17)
#define USB_GRXSTSP_PKTSTS_MASK          (0xf << (USB_GRXSTSP_PKTSTS_SHIFT))
#define USB_GRXSTSP_PKTSTS_OUT_NAK       (1 << (USB_GRXSTSP_PKTSTS_SHIFT))
#define USB_GRXSTSP_PKTSTS_OUT_RECV      (2 << (USB_GRXSTSP_PKTSTS_SHIFT))
#define USB_GRXSTSP_PKTSTS_INOUT_COMPLETE (3 << (USB_GRXSTSP_PKTSTS_SHIFT))
#define USB_GRXSTSP_PKTSTS_SETUP_COPMLETE (4 << (USB_GRXSTSP_PKTSTS_SHIFT))
#define USB_GRXSTSP_PKTSTS_TOGGLE_ERROR  (5 << (USB_GRXSTSP_PKTSTS_SHIFT))
#define USB_GRXSTSP_PKTSTS_SETUP_RECV    (6 << (USB_GRXSTSP_PKTSTS_SHIFT))
#define USB_GRXSTSP_PKTSTS_CH_HALT       (7 << (USB_GRXSTSP_PKTSTS_SHIFT))
#define USB_GRXSTSP_DPID_SHIFT           (15)
#define USB_GRXSTSP_DPID_MASK            (3 << (USB_GRXSTSP_DPID_SHIFT))
#define USB_GRXSTSP_DPID_DATA0           (0 << (USB_GRXSTSP_DPID_SHIFT))
#define USB_GRXSTSP_DPID_DATA1           (1 << (USB_GRXSTSP_DPID_SHIFT))
#define USB_GRXSTSP_DPID_DATA2           (2 << (USB_GRXSTSP_DPID_SHIFT))
#define USB_GRXSTSP_DPID_MDATA           (3 << (USB_GRXSTSP_DPID_SHIFT))
#define USB_GRXSTSP_BCNT_SHIFT           (4)
#define USB_GRXSTSP_BCNT_MASK            (0x3ff << (USB_GRXSTSP_BCNT_SHIFT))
#define USB_GRXSTSP_EPNUM_SHIFT          (0)
#define USB_GRXSTSP_EPNUM_MASK           (0xf << (USB_GRXSTSP_EPNUM_SHIFT))

  __IO uint32_t         GRXFSIZ;
#define USB_GRXSIZ_RXFD_SHIFT           (0)
#define USB_GRXSIZ_RXFD_MASK            (0xffff << (USB_GRXSIZ_RXFD_SHIFT))
  __IO uint32_t         DIEPTXF0_HNPTXFSIZ;
#define USB_DIEPTXF_FD_SHIFT            (16)
#define USB_DIEPTXF_FD_MASK             (0xffff << (USB_DIEPTXF_FD_SHIFT))
#define USB_DIEPTXF_SA_SHIFT            (0)
#define USB_DIEPTXF_SA_MASK             (0xffff << (USB_DIEPTXF_SA_SHIFT))
  __IO uint32_t         HNPTXSTS;
  __IO uint32_t         GI2CCTL;
  uint32_t              reserved_034;
  __IO uint32_t         GCCFG;
#define USB_GCCFG_VBDEN_SHIFT           (21)
#define USB_GCCFG_VBDEN_MASK            (3 << (USB_GCCFG_VBDEN_SHIFT))
#define USB_GCCFG_VBDEN_NO              (0 << (USB_GCCFG_VBDEN_SHIFT))
#define USB_GCCFG_VBDEN_YES             (1 << (USB_GCCFG_VBDEN_SHIFT))
#define USB_GCCFG_SDEN_SHIFT            (20)
#define USB_GCCFG_SDEN_MASK             (3 << (USB_GCCFG_SDEN_SHIFT))
#define USB_GCCFG_SDEN_NO               (0 << (USB_GCCFG_SDEN_SHIFT))
#define USB_GCCFG_SDEN_YES              (1 << (USB_GCCFG_SDEN_SHIFT))
#define USB_GCCFG_PDEN_SHIFT            (19)
#define USB_GCCFG_PDEN_MASK             (3 << (USB_GCCFG_PDEN_SHIFT))
#define USB_GCCFG_PDEN_NO               (0 << (USB_GCCFG_PDEN_SHIFT))
#define USB_GCCFG_PDEN_YES              (1 << (USB_GCCFG_PDEN_SHIFT))
#define USB_GCCFG_PWRDWN_SHIFT          (16)
#define USB_GCCFG_PWRDWN_MASK           (3 << (USB_GCCFG_PWRDWN_SHIFT))
#define USB_GCCFG_PWRDWN_NO             (0 << (USB_GCCFG_PWRDWN_SHIFT))
#define USB_GCCFG_PWRDWN_YES            (1 << (USB_GCCFG_PWRDWN_SHIFT))
  __IO uint32_t         CID;
  __IO uint32_t         GSNPSID;
  __IO uint32_t         GHWCFG1;
  __IO uint32_t         GHWCFG2;
  __IO uint32_t         GHWCFG3;
  uint32_t              reserved_050;
  __IO uint32_t         GLPMCFG;
  __IO uint32_t         GPWRDN;
  __IO uint32_t         GDFIFOCFG;
  __IO uint32_t         GADPCTL;
  uint32_t              reserved_064[39];
  /* 0x100 */
  __IO uint32_t         HPTXFSIZ;
  __IO uint32_t         DIEPTXF[15];

  /* 0x140 */
  uint32_t              reserved_140[0xb0];

  /* 0x400   host controller */
  __IO uint32_t         HCFGM;
  __IO uint32_t         HFIR;
  __IO uint32_t         HAFNUM;
  uint32_t              reserved_40c;
  __IO uint32_t         XPTXSTS;
  __IO uint32_t         HAINT;
  __IO uint32_t         HAINTMSK;
  uint32_t              reserved_41c[0x9];
  __IO uint32_t         HPRT;
#define USB_HPRT_PRST_SHIFT             (8)
#define USB_HPRT_PRST_MASK              (1 << (USB_HPRT_PRST_SHIFT))
#define USB_HPRT_PRST_NO                (0 << (USB_HPRT_PRST_SHIFT))
#define USB_HPRT_PRST_YES               (1 << (USB_HPRT_PRST_SHIFT))
#define USB_HPRT_POCCHNG_SHIFT          (5)
#define USB_HPRT_POCCHNG_MASK           (1 << (USB_HPRT_POCCHNG_SHIFT))
#define USB_HPRT_POCCHNG_NO             (0 << (USB_HPRT_POCCHNG_SHIFT))
#define USB_HPRT_POCCHNG_YES            (1 << (USB_HPRT_POCCHNG_SHIFT))
#define USB_HPRT_PENCHNG_SHIFT          (5)
#define USB_HPRT_PENCHNG_MASK           (1 << (USB_HPRT_PENCHNG_SHIFT))
#define USB_HPRT_PENCHNG_NO             (0 << (USB_HPRT_PENCHNG_SHIFT))
#define USB_HPRT_PENCHNG_YES            (1 << (USB_HPRT_PENCHNG_SHIFT))
#define USB_HPRT_PENA_SHIFT             (2)
#define USB_HPRT_PENA_MASK              (1 << (USB_HPRT_PENA_SHIFT))
#define USB_HPRT_PENA_NO                (0 << (USB_HPRT_PENA_SHIFT))
#define USB_HPRT_PENA_YES               (1 << (USB_HPRT_PENA_SHIFT))
#define USB_HPRT_PCDET_SHIFT            (1)
#define USB_HPRT_PCDET_MASK             (1 << (USB_HPRT_PCDET_SHIFT))
#define USB_HPRT_PCDET_NO               (0 << (USB_HPRT_PCDET_SHIFT))
#define USB_HPRT_PCDET_YES              (1 << (USB_HPRT_PCDET_SHIFT))
#define USB_HPRT_PCSTS_SHIFT            (0)
#define USB_HPRT_PCSTS_MASK             (1 << (USB_HPRT_PCSTS_SHIFT))
#define USB_HPRT_PCSTS_NO               (0 << (USB_HPRT_PCSTS_SHIFT))
#define USB_HPRT_PCSTS_YES              (1 << (USB_HPRT_PCSTS_SHIFT))
  uint32_t              reserved_444[0xef];

  /* 0x800   device controller */
  __IO uint32_t         DCFG;
#define USB_DCFG_DAD_SHIFT              (4)
#define USB_DCFG_DAD_MASK               (0x7f << (USB_DCFG_DAD_SHIFT))
#define USB_DCFG_DSPD_SHIFT             (0)
#define USB_DCFG_DSPD_MASK              (3 << (USB_DCFG_DSPD_SHIFT))
#define USB_DCFG_DSPD_HS                (0 << (USB_DCFG_DSPD_SHIFT))
#define USB_DCFG_DSPD_FS_IN_HS          (1 << (USB_DCFG_DSPD_SHIFT))
#define USB_DCFG_DSPD_RESERVED2         (2 << (USB_DCFG_DSPD_SHIFT))
#define USB_DCFG_DSPD_FS                (3 << (USB_DCFG_DSPD_SHIFT))

  __IO uint32_t         DCTL;
#define USB_DCTL_CGONAK_SHIFT           (10)
#define USB_DCTL_CGONAK_MASK            (1 << (USB_DCTL_CGONAK_SHIFT))
#define USB_DCTL_CGONAK_HIGH            (0 << (USB_DCTL_CGONAK_SHIFT))
#define USB_DCTL_CGONAK_FULL            (1 << (USB_DCTL_CGONAK_SHIFT))
#define USB_DCTL_SGONAK_SHIFT           (9)
#define USB_DCTL_SGONAK_MASK            (1 << (USB_DCTL_SGONAK_SHIFT))
#define USB_DCTL_SGONAK_HIGH            (0 << (USB_DCTL_SGONAK_SHIFT))
#define USB_DCTL_SGONAK_FULL            (1 << (USB_DCTL_SGONAK_SHIFT))
#define USB_DCTL_CGINAK_SHIFT           (8)
#define USB_DCTL_CGINAK_MASK            (1 << (USB_DCTL_CGINAK_SHIFT))
#define USB_DCTL_CGINAK_HIGH            (0 << (USB_DCTL_CGINAK_SHIFT))
#define USB_DCTL_CGINAK_FULL            (1 << (USB_DCTL_CGINAK_SHIFT))
#define USB_DCTL_SGINAK_SHIFT           (7)
#define USB_DCTL_SGINAK_MASK            (1 << (USB_DCTL_SGINAK_SHIFT))
#define USB_DCTL_SGINAK_HIGH            (0 << (USB_DCTL_SGINAK_SHIFT))
#define USB_DCTL_SGINAK_FULL            (1 << (USB_DCTL_SGINAK_SHIFT))
#define USB_DCTL_SDIS_SHIFT             (1)
#define USB_DCTL_SDIS_MASK              (1 << (USB_DCTL_SDIS_SHIFT))
#define USB_DCTL_SDIS_CONNECT           (0 << (USB_DCTL_SDIS_SHIFT))
#define USB_DCTL_SDIS_DISCONNECT        (1 << (USB_DCTL_SDIS_SHIFT))
#define USB_DCTL_RWUSIG_SHIFT           (0)
#define USB_DCTL_RWUSIG_MASK            (1 << (USB_DCTL_RWUSIG_SHIFT))
#define USB_DCTL_RWUSIG_CONNECT         (0 << (USB_DCTL_RWUSIG_SHIFT))
#define USB_DCTL_RWUSIG_DISCONNECT      (1 << (USB_DCTL_RWUSIG_SHIFT))

