mfkiwl/McuDevelop/Devices/STM32/include/stm32Otg.h
  __IO uint32_t         DSTS;
#define USB_DSTS_FNSOF_SHIFT            (8)
#define USB_DSTS_FNSOF_MASK             (0x3ff << (USB_DSTS_FNSOF_SHIFT))
#define USB_DSTS_FNSOF_LSB_MASK         (1     << (USB_DSTS_FNSOF_SHIFT))
#define USB_DSTS_EERR_SHIFT             (3)
#define USB_DSTS_EERR_MASK              (1 << (USB_DSTS_EERR_SHIFT))
#define USB_DSTS_EERR_NO                (0 << (USB_DSTS_EERR_SHIFT))
#define USB_DSTS_EERR_YES               (1 << (USB_DSTS_EERR_SHIFT))
#define USB_DSTS_ENUMSPD_SHIFT          (1)
#define USB_DSTS_ENUMSPD_MASK           (3 << (USB_DSTS_ENUMSPD_SHIFT))
#define USB_DSTS_ENUMSPD_HIGH           (0 << (USB_DSTS_ENUMSPD_SHIFT))
#define USB_DSTS_ENUMSPD_FULL           (3 << (USB_DSTS_ENUMSPD_SHIFT))
#define USB_DSTS_SUSPSTS_SHIFT          (0)
#define USB_DSTS_SUSPSTS_MASK           (1 << (USB_DSTS_SUSPSTS_SHIFT))
#define USB_DSTS_SUSPSTS_NO             (0 << (USB_DSTS_SUSPSTS_SHIFT))
#define USB_DSTS_SUSPSTS_YES            (1 << (USB_DSTS_SUSPSTS_SHIFT))

  uint32_t              Reserved_80c;
  __IO uint32_t         DIEPMSK;
#define USB_DIEPMSK_NAKM_SHIFT          (12)
#define USB_DIEPMSK_NAKM_MASK           (1 << (USB_DIEPMSK_NAKM_SHIFT))
#define USB_DIEPMSK_NAKM_EN             (1 << (USB_DIEPMSK_NAKM_SHIFT))
#define USB_DIEPMSK_INEPNEM_SHIFT       (6)
#define USB_DIEPMSK_INEPNEM_MASK        (1 << (USB_DIEPMSK_INEPNEM_SHIFT))
#define USB_DIEPMSK_INEPNEM_EN          (1 << (USB_DIEPMSK_INEPNEM_SHIFT))
#define USB_DIEPMSK_INEPNMM_SHIFT       (5)
#define USB_DIEPMSK_INEPNMM_MASK        (1 << (USB_DIEPMSK_INEPNMM_SHIFT))
#define USB_DIEPMSK_INEPNMM_EN          (1 << (USB_DIEPMSK_INEPNMM_SHIFT))
#define USB_DIEPMSK_ITTXFEMSK_SHIFT     (4)
#define USB_DIEPMSK_ITTXFEMSK_MASK      (1 << (USB_DIEPMSK_ITTXFEMSK_SHIFT))
#define USB_DIEPMSK_ITTXFEMSK_EN        (1 << (USB_DIEPMSK_ITTXFEMSK_SHIFT))
#define USB_DIEPMSK_TOM_SHIFT           (3)
#define USB_DIEPMSK_TOM_MASK            (1 << (USB_DIEPMSK_TOM_SHIFT))
#define USB_DIEPMSK_TOM_EN              (1 << (USB_DIEPMSK_TOM_SHIFT))
#define USB_DIEPMSK_EPDM_SHIFT          (1)
#define USB_DIEPMSK_EPDM_MASK           (1 << (USB_DIEPMSK_EPDM_SHIFT))
#define USB_DIEPMSK_EPDM_EN             (1 << (USB_DIEPMSK_EPDM_SHIFT))
#define USB_DIEPMSK_XFRCM_SHIFT         (0)
#define USB_DIEPMSK_XFRCM_MASK          (1 << (USB_DIEPMSK_XFRCM_SHIFT))
#define USB_DIEPMSK_XFRCM_EN            (1 << (USB_DIEPMSK_XFRCM_SHIFT))
  __IO uint32_t         DOEPMSK;
#define USB_DOEPMSK_NYETM_SHIFT         (14)
#define USB_DOEPMSK_NYETM_MASK          (1 << (USB_DOEPMSK_NYETM_SHIFT))
#define USB_DOEPMSK_NYETM_EN            (1 << (USB_DOEPMSK_NYETM_SHIFT))
#define USB_DOEPMSK_BOIM_SHIFT          (9)
#define USB_DOEPMSK_BOIM_MASK           (1 << (USB_DOEPMSK_BOIM_SHIFT))
#define USB_DOEPMSK_BOIM_EN             (1 << (USB_DOEPMSK_BOIM_SHIFT))
#define USB_DOEPMSK_TXFURM_SHIFT        (8)
#define USB_DOEPMSK_TXFURM_MASK         (1 << (USB_DOEPMSK_TXFURM_SHIFT))
#define USB_DOEPMSK_TXFURM_EN           (1 << (USB_DOEPMSK_TXFURM_SHIFT))
#define USB_DOEPMSK_B2BSTUPM_SHIFT      (6)
#define USB_DOEPMSK_B2BSTUPM_MASK       (1 << (USB_DOEPMSK_B2BSTUPM_SHIFT))
#define USB_DOEPMSK_B2BSTUPM_EN         (1 << (USB_DOEPMSK_B2BSTUPM_SHIFT))
#define USB_DOEPMSK_ETEPDM_SHIFT        (4)
#define USB_DOEPMSK_ETEPDM_MASK         (1 << (USB_DOEPMSK_ETEPDM_SHIFT))
#define USB_DOEPMSK_ETEPDM_EN           (1 << (USB_DOEPMSK_ETEPDM_SHIFT))
#define USB_DOEPMSK_STUPM_SHIFT         (3)
#define USB_DOEPMSK_STUPM_MASK          (1 << (USB_DOEPMSK_STUPM_SHIFT))
#define USB_DOEPMSK_STUPM_EN            (1 << (USB_DOEPMSK_STUPM_SHIFT))
#define USB_DOEPMSK_EPDM_SHIFT          (1)
#define USB_DOEPMSK_EPDM_MASK           (1 << (USB_DOEPMSK_EPDM_SHIFT))
#define USB_DOEPMSK_EPDM_EN             (1 << (USB_DOEPMSK_EPDM_SHIFT))
#define USB_DOEPMSK_XFRCM_SHIFT         (0)
#define USB_DOEPMSK_XFRCM_MASK          (1 << (USB_DOEPMSK_XFRCM_SHIFT))
#define USB_DOEPMSK_XFRCM_EN            (1 << (USB_DOEPMSK_XFRCM_SHIFT))

  __IO uint32_t         DAINT;
#define USB_DAINT_OEPINT_SHIFT          (16)
#define USB_DAINT_OEPINT_MASK           (0xffff << (USB_DAINT_OEPINT_SHIFT))
#define USB_DAINT_OEPINT_BIT(x)         (((1<<(x)) << (USB_DAINT_OEPINT_SHIFT)) & (USB_DAINT_OEPINT_MASK))
#define USB_DAINT_IEPINT_SHIFT          (0)
#define USB_DAINT_IEPINT_MASK           (0xffff << (USB_DAINT_IEPINT_SHIFT))
#define USB_DAINT_IEPINT_BIT(x)         (((1<<(x)) << (USB_DAINT_IEPINT_SHIFT)) & (USB_DAINT_IEPINT_MASK))

  __IO uint32_t         DAINTMSK;
  uint32_t              reserved_820;
  uint32_t              reserved_824;
  __IO uint32_t         DVBUSDIS;
  __IO uint32_t         DVBUSPULSE;
  __IO uint32_t         DTHRCTL;
#define USB_DTHRCTL_RXTHRLEN_SHIFT      (17)
#define USB_DTHRCTL_RXTHRLEN_MASK       (0x3ff << (USB_DTHRCTL_RXTHRLEN_SHIFT))
#define USB_DTHRCTL_RXTHRLEN_VAL(x)     (((x) << (USB_DTHRCTL_RXTHRLEN_SHIFT))&USB_DTHRCTL_RXTHRLEN_MASK)
#define USB_DTHRCTL_RXTHREN_SHIFT       (16)
#define USB_DTHRCTL_RXTHREN_MASK        (1 << (USB_DTHRCTL_RXTHREN_SHIFT))
#define USB_DTHRCTL_RXTHREN_NO          (0 << (USB_DTHRCTL_RXTHREN_SHIFT))
#define USB_DTHRCTL_RXTHREN_YES         (1 << (USB_DTHRCTL_RXTHREN_SHIFT))
#define USB_DTHRCTL_TXTHRLEN_SHIFT      (2)
#define USB_DTHRCTL_TXTHRLEN_MASK       (0x3ff << (USB_DTHRCTL_TXTHRLEN_SHIFT))
#define USB_DTHRCTL_TXTHRLEN_VAL(x)     (((x) << (USB_DTHRCTL_TXTHRLEN_SHIFT))&USB_DTHRCTL_TXTHRLEN_MASK)
#define USB_DTHRCTL_ISOTHREN_SHIFT      (1)
#define USB_DTHRCTL_ISOTHREN_MASK       (1 << (USB_DTHRCTL_ISOTHREN_SHIFT))
#define USB_DTHRCTL_ISOTHREN_NO         (0 << (USB_DTHRCTL_ISOTHREN_SHIFT))
#define USB_DTHRCTL_ISOTHREN_YES        (1 << (USB_DTHRCTL_ISOTHREN_SHIFT))
#define USB_DTHRCTL_NONISOTHREN_SHIFT   (0)
#define USB_DTHRCTL_NONISOTHREN_MASK    (1 << (USB_DTHRCTL_NONISOTHREN_SHIFT))
#define USB_DTHRCTL_NONISOTHREN_NO      (0 << (USB_DTHRCTL_NONISOTHREN_SHIFT))
#define USB_DTHRCTL_NONISOTHREN_YES     (1 << (USB_DTHRCTL_NONISOTHREN_SHIFT))

  __IO uint32_t         DIEPEMPMSK;
  __IO uint32_t         DEACHINT;
  __IO uint32_t         DEACHINTMSK;
  uint32_t              reserved_840;
  __IO uint32_t         DINEP1MSK;
  uint32_t              reserved_848;
  __IO uint32_t         DOUTEP1MSK;
  uint32_t              reserved_850[0x2c];

  /* 0x900 */
  stm32Usb320aDevEp_t   in[16];         /* 0x20 * 0x10pcs = 0x200 */

  /* 0xb00 */
  stm32Usb320aDevEp_t   out[16];        /* 0x20 * 0x10pcs = 0x200 */

