mfkiwl/McuDevelop/Devices/STM32/include/stm32Otg.h
  /* 0xd00 */
  uint32_t              reserved_d00[0x40];


  /* 0xe00 */
  __IO uint32_t         PCGCCTL;
#define USB_PCGCCTL_STOPCLK_SHIFT       (0)
#define USB_PCGCCTL_STOPCLK_MASK        (1 << (USB_PCGCCTL_STOPCLK_SHIFT))
#define USB_PCGCCTL_STOPCLK_NO          (0 << (USB_PCGCCTL_STOPCLK_SHIFT))
#define USB_PCGCCTL_STOPCLK_YES         (1 << (USB_PCGCCTL_STOPCLK_SHIFT))
  uint32_t              reserved_e04[0x7f];

  /* 0x1000  FIFO */
#define USB_FIFO_SIZE   0x1000
  __IO uint32_t         DFIFO[15][USB_FIFO_SIZE/4];

} stm32Dev_USB;



#define USB_OTG_CORE_ID_310A            0x4F54310A
#define USB_OTG_CORE_ID_320A            0x4F54320A


/*** 0x0c OTG_GUSBCFG */
#define USB_GUSBCFG_FDMOD_SHIFT         (30)
#define USB_GUSBCFG_FDMOD_MASK          (1 << (USB_GUSBCFG_FDMOD_SHIFT))
#define USB_GUSBCFG_FDMOD_NO            (0 << (USB_GUSBCFG_FDMOD_SHIFT))
#define USB_GUSBCFG_FDMOD_YES           (1 << (USB_GUSBCFG_FDMOD_SHIFT))
#define USB_GUSBCFG_FHMOD_SHIFT         (29)
#define USB_GUSBCFG_FHMOD_MASK          (1 << (USB_GUSBCFG_FHMOD_SHIFT))
#define USB_GUSBCFG_FHMOD_NO            (0 << (USB_GUSBCFG_FHMOD_SHIFT))
#define USB_GUSBCFG_FHMOD_YES           (1 << (USB_GUSBCFG_FHMOD_SHIFT))
#define USB_GUSBCFG_TRDT_SHIFT          (10)
#define USB_GUSBCFG_TRDT_MASK           (15 << (USB_GUSBCFG_TRDT_SHIFT))
#define USB_GUSBCFG_TRDT_OVER32_0MHZ    (6 << (USB_GUSBCFG_TRDT_SHIFT))
#define USB_GUSBCFG_TRDT_27_5TO32_0MHZ  (7 << (USB_GUSBCFG_TRDT_SHIFT))
#define USB_GUSBCFG_TRDT_24_0TO27_5MHZ  (8 << (USB_GUSBCFG_TRDT_SHIFT))
#define USB_GUSBCFG_TRDT_21_8TO24_0MHZ  (9 << (USB_GUSBCFG_TRDT_SHIFT))
#define USB_GUSBCFG_TRDT_20_0TO21_8MHZ  (10 << (USB_GUSBCFG_TRDT_SHIFT))
#define USB_GUSBCFG_TRDT_18_5TO20_0MHZ  (11 << (USB_GUSBCFG_TRDT_SHIFT))
#define USB_GUSBCFG_TRDT_17_2TO18_5MHZ  (12 << (USB_GUSBCFG_TRDT_SHIFT))
#define USB_GUSBCFG_TRDT_16_0TO17_2MHZ  (13 << (USB_GUSBCFG_TRDT_SHIFT))
#define USB_GUSBCFG_TRDT_15_0TO16_0MHZ  (14 << (USB_GUSBCFG_TRDT_SHIFT))
#define USB_GUSBCFG_TRDT_14_2TO15_0MHZ  (15 << (USB_GUSBCFG_TRDT_SHIFT))
#define USB_GUSBCFG_PHYSEL_SHIFT        (6)
#define USB_GUSBCFG_PHYSEL_MASK         (1 << (USB_GUSBCFG_PHYSEL_SHIFT))
#define USB_GUSBCFG_PHYSEL_NO           (0 << (USB_GUSBCFG_PHYSEL_SHIFT))
#define USB_GUSBCFG_PHYSEL_YES          (1 << (USB_GUSBCFG_PHYSEL_SHIFT))


#endif
